{
    "Python": {
        "print": "Команда для печати сообщений на экране или другом стандартном устройстве вывода. Команда print может использоваться для печати любого типа объекта — целого числа, строки, списка, кортежа и других.",
        "if": "Команда if оценивает выражение и, если оно истинно (true), выполняет операторы под ним.",
        "list": "Функция Python list() принимает любую итерацию (объект, который можно перебирать) в качестве параметра и возвращает список",
        "while": "Команда while используется для выполнения набора операторов, если заданное условие истинно",
        "input": "Команда для получения ввода от пользователя. Исполнение программы будет остановлено до тех пор, пока пользователь не введет какое-либо значение, которое будет преобразовано функцией input() в строку",
        "def": "Команда определения функции Python дает возможность оборачивать повторно используемый код внутри функций, чтобы вызваны его позже, когда это необходимо",
        "len": "Команда len или функция len() используются для подсчёта количества элементов в объекте. Если объект является строкой, то функция len() возвращает количество присутствующих в ней символов",
        "class": "Команда для создания классов. Python поддерживает объектно-ориентированное программирование и позволяет пользователям создавать классы и инициализировать объекты",
        "find": "Команда find() используется для поиска подстроки в строке. Если таковая найдена,find() возвращает индекс первого вхождения подстроки, в противном случае возвращает -1.",
        "for": "Команда цикла for используется для выполнения набора операторов путем повторения последовательности. Эта последовательность может быть списком, кортежем, строкой, словарем и т. д."
    },
    "Turtle": {
        "forward": "Проползти вперед n шагов (пикселей).",
        "backward": "Проползти назад n шагов (пикселей).,",
        "left": "Повернуться налево на n градусов.",
        "right": "Повернуться направо на n градусов.",
        "circle":"Нарисовать окружность радиуса |r|, центр которой находится слева от черепашки, если r>0 и справа, если r<0.",
        "goto":"Переместить черепашку в точку с координатами (x, y)",
        "pencolor":"Установить цвет пера черепашки. Цвет задается текстовой строкой, заключенной в кавычки,",
        "clear":"Очистка экрана."
    },
    "Biblioteki":{
        "Turtle" : " графическая библиотека, встроенная в язык программирования Python. Она предназначена для создания простых, но эффективных графических приложений, основанных на использовании графического интерфейса черепахи (turtle graphics).",
        "PyQt" : "набор библиотек, написанных на языке программирования Python для Qt — кросс-платформенного фреймворка, используемого в разработке графических интерфейсов пользователя (GUI). Используя его, разработчик может создавать приложения намного быстрее, не жертвуя при этом значительной частью производительности C++.",
        "Telebot": "это библиотека Python, которая предоставляет интерфейс для взаимодействия с Telegram Bot API. Она позволяет отправлять сообщения, создавать встроенные клавиатуры, обрабатывать обратные вызовы и выполнять множество других действий с легкостью.",
        "Requests": "то библиотека, которая создана для быстрой и простой работы с запросами. Стандартные HTTP-библиотеки Python, например та же Urllib3, часто требуют значительно больше кода для выполнения одного и того же действия, а это затрудняет работу.Apr 12, 2023",
        "Json" : "стандартный текстовый формат для хранения и передачи структурированных данных. Он основан на синтаксисе объекта в JavaScript, но не привязан к нему. Работу с ним поддерживают многие современные языки программирования: Python, Java и другие",
        "Pygame": "набор модулей (библиотек) языка программирования Python, предназначенный для написания компьютерных игр и мультимедиа-приложений. Pygame базируется на мультимедийной библиотеке SDL."



    }
}